---
kind: method
id: M:Autodesk.Revit.DB.ConnectorElement.GetLinkedConnectorElement
source: html/f805f94d-74db-3f3f-711a-6e3e38cea61c.htm
---
# Autodesk.Revit.DB.ConnectorElement.GetLinkedConnectorElement Method

Get the linked connector element.

## Syntax (C#)
```csharp
public ConnectorElement GetLinkedConnectorElement()
```

## Returns
The linked connector element. If Nothing nullptr a null reference ( Nothing in Visual Basic) , the connector has no link.